# **Esercizi Pandas**

In [25]:
import pandas as pd
import numpy as np

## **Esercizio 1**
Utilizzare un dataset di esempio che include le seguenti informazioni su un gruppo di persone: Nome, Età, Città e Salario.

1. Caricare i dati in un DataFrame autogenerandoli casualmente.

In [2]:
import random

In [26]:
Base_nomi=['Martina','Giuseppe','Valeria','Sofia','Giulia','Francesco','Cristian','Mario','Valentina','Fabio',np.nan]
Base_città=['Palermo','Cagliari','Catanzaro','Potenza','Bari','Campobasso', 'Ancona','Roma','Firenze','Bologna',np.nan]

In [27]:
Nomi = random.choices(Base_nomi, k=100)
Città = random.choices(Base_città, k=100)
Età = [random.randint(16, 80) for _ in range(100)]
Salario = [random.uniform(1000, 5000) for _ in range(100)]

In [28]:
data = {'Nomi':Nomi,'Città':Città,'Età':Età,'Salario':Salario}

In [29]:
df = pd.DataFrame(data)

In [49]:
df['Età'].replace(50, np.nan, inplace=True)
df['Età'].replace(30, np.nan, inplace=True)
df['Età'].replace(60, np.nan, inplace=True)

2. Visualizzare le prime e le ultime cinque righe del DataFrame.

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nomi     90 non-null     object
 1   Città    90 non-null     object
 2   Età      97 non-null     float64
 3   Salario  100 non-null    float64
dtypes: float64(2), object(2)
memory usage: 3.3+ KB

In [19]:
df.head(5)

        Nomi    Città  Età      Salario
0    Martina   Ancona   37  1936.620376
1      Sofia  Potenza   43  1724.545994
2      Mario  Palermo   39  3629.581752
3      Fabio     Roma   32  3481.917033
4  Valentina   Ancona   24  4704.639401

In [20]:
df.tail(5)

         Nomi    Città  Età      Salario
95     Giulia  Firenze   71  2679.447983
96   Cristian  Firenze   19  2080.480635
97  Valentina  Palermo   60  2460.261682
98      Fabio     Bari   48  1066.634160
99  Francesco   Ancona   32  2677.114031

3. Visualizzare il tipo di dati di ciascuna colonna.

In [17]:
df.dtypes

Nomi        object
Città       object
Età          int64
Salario    float64
dtype: object

4. Calcolare statistiche descrittive di base per le colonne numeriche (media, mediana, deviazione standard).

In [21]:
print("Media Età:",df['Età'].mean(),"\nMediana Età:",df['Età'].median(),"\nDeviazione Standard Età:",df['Età'].std())
print("Media Salario:",df['Salario'].mean(),"\nMediana Salario:",df['Salario'].median(),"\nDeviazione Standard Salario:",df['Salario'].std())

Media Età: 48.17
Mediana Età: 48.0
Deviazione Standard Età: 16.341095867212033
Media Salario: 2896.1790981560816
Mediana Salario: 2747.606185780204
Deviazione Standard Salario: 1122.7899194161448

5. Identificare e rimuovere eventuali duplicati.

In [24]:
duplicati = df.duplicated()
print(duplicati)

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [22]:
df = df.drop_duplicates()

6. Gestire i valori mancanti sostituendoli con la mediana della rispettiva
colonna.

In [52]:
df['Nomi'].fillna(df['Nomi'].mode()[0], inplace=True)
df['Età'].fillna(df['Età'].median(), inplace=True)
df['Città'].fillna(df['Città'].mode()[0], inplace=True)
df['Salario'].fillna(df['Salario'].median(), inplace=True)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nomi     100 non-null    object
 1   Città    100 non-null    object
 2   Età      100 non-null    float64
 3   Salario  100 non-null    float64
dtypes: float64(2), object(2)
memory usage: 3.3+ KB

7. Aggiungere una nuova colonna chiamata "Categoria Età" che classifica le persone come "Giovane", "Adulto" o "Senior" basandosi sull'età (es., 0-18 anni: Giovane, 19-65 anni: Adulto, oltre 65 anni: Senior).

In [54]:
df["Categoria Età"]=df['Età'].apply(lambda x: 'Giovane' if x < 18 else ('Adulto' if x < 65 else 'Senior'))

In [56]:
df.head()

        Nomi       Città   Età      Salario Categoria Età
0    Valeria     Potenza  67.0  1749.495838        Senior
1      Fabio  Campobasso  77.0  1961.028835        Senior
2      Mario     Potenza  20.0  2895.441627        Adulto
3      Mario      Ancona  44.0  4438.823794        Adulto
4  Francesco     Potenza  21.0  4015.388200        Adulto

8. Salvare il DataFrame pulito in un nuovo file CSV.

In [58]:
df.to_csv('data.csv', index=False)

## **Esercizio 2**

Generare un DataFrame di vendite che include i seguenti campi: "Data", "Città", "Prodotto" e "Vendite". I dati devono essere generati per un periodo di un mese, con vendite registrate per tre diverse città e tre tipi di prodotti.

1. Generazione dei Dati: utilizzare numpy per creare un set di dati
casuali.

In [61]:
base_città=['Roma','Milano','Cosenza','Torino']
base_prodotti=['TV','Laptop','Lavatrice']

In [66]:
Città = random.choices(base_città, k=15)
Prodotti = random.choices(base_prodotti, k=15)
Vendite = [random.randint(0,500) for _ in range(15)]
Date = pd.date_range(start='2023-01-01', periods=15, freq='D')

In [69]:
dati = {
    'Date':Date,
    'Città':Città,
    'Prodotti':Prodotti,
    'Vendite':Vendite
}

df=pd.DataFrame(dati)
print(df)

         Date    Città   Prodotti  Vendite
0  2023-01-01   Milano     Laptop       93
1  2023-01-02   Milano  Lavatrice      242
2  2023-01-03   Torino     Laptop      278
3  2023-01-04  Cosenza  Lavatrice      315
4  2023-01-05  Cosenza         TV      342
5  2023-01-06   Milano  Lavatrice      236
6  2023-01-07     Roma     Laptop      396
7  2023-01-08     Roma  Lavatrice      289
8  2023-01-09     Roma  Lavatrice      384
9  2023-01-10     Roma     Laptop      237
10 2023-01-11     Roma         TV      290
11 2023-01-12     Roma  Lavatrice      388
12 2023-01-13     Roma     Laptop      161
13 2023-01-14   Milano  Lavatrice      156
14 2023-01-15   Milano  Lavatrice      111

2. Creazione della Tabella Pivot: Creare una tabella pivot per analizzare le vendite medie di ciascun prodotto per città.

In [71]:
pivot_df = df.pivot_table(values='Vendite', index='Prodotti', columns='Città', aggfunc='mean')
print(pivot_df)

Città      Cosenza  Milano        Roma  Torino
Prodotti
Laptop         NaN   93.00  264.666667   278.0
Lavatrice    315.0  186.25  353.666667     NaN
TV           342.0     NaN  290.000000     NaN

3. Applicazione di GroupBy: Utilizzare il metodo groupby per calcolare le vendite totali per ogni prodotto.

In [76]:
grouped_df = df.groupby('Prodotti').sum()
print(grouped_df)

           Vendite
Prodotti
Laptop        1165
Lavatrice     2121
TV             632

C:\Users\curci\AppData\Local\Temp\ipykernel_6248\3396723241.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped_df = df.groupby('Prodotti').sum()